channel/Simulation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3600;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;//adjustableRunTime can modifiy the time step size

adjustTimeStep  yes;//adjustableRunTime can modifiy the time step size

//JN: Co = U*dt/dx
//U is defined by the flow
//dx is defined by the cell size i.e. the mesh
//Co should be below or equal to 1
//dt is the only value, which can guarantee this
//dt is changed in each time step

maxCo           1.0;//maximum value for Courant number
maxAlphaCo      1.0;//maximum value for Courant number of the interface water/air

maxDeltaT       1;//maximum time step


// ************************************************************************* //
